a = input()
b = input()
a = a.lower()
b = b.lower()
if (a == "красный" or a == "синий" or a == "желтый") and (b == "красный" or b == "синий" or b == "желтый"):
    if (a == "красный" and b == "синий") or (b == "красный" and a == "синий"):
        print("Фиолетовый")
    elif (a == "красный" and b == "желтый") or (b == "красный" and a == "желтый"):
        print("Оранжевый")
    elif (a == "синий" and b == "желтый") or (b == "синий" and a == "желтый"):
        print("Зеленый")
    else:
        print("Нет данных")
else:
    print("Введеные цвета не прописаны в инструкции")